In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df = pd.read_csv('data.csv')
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [5]:
df=df[['Annual Income (k$)','Spending Score (1-100)']]
df.head()

   Annual Income (k$)  Spending Score (1-100)
0                  15                      39
1                  15                      81
2                  16                       6
3                  16                      77
4                  17                      40

In [6]:
df.isnull().sum()

Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [8]:
from sklearn.cluster import KMeans
kmeans=KMeans()

In [12]:
from sklearn.model_selection import train_test_split

In [16]:
X_train,X_test=train_test_split(df,random_state=12)

In [17]:
X_test.shape

(50, 2)

In [ ]:
from i in range(2,20):
    kmeans.fit(n_cluster=i,X_train)